/*
- 과제 1 + 2 + 3 + 4 중 3개 미만으로 할 시 깜지 추가

과제1. rand()를 활용한 랜덤값 출력

- 900 경부터 -> 923경까지의 랜덤한 숫자를 뽑으시오.

9000000000000000000

- 필수 : 분포도
ㄴ 총 10번의 분포도를 화면에 출력하고 확률을 표시한다.

과제2. 복습 과제

1. 두 정수의 합을 구하는 프로그램 작성
- 두 개의 숫자를 사용자를 입력 받는다.

- 입력한 두 숫자 사이의 합을 출력하면 ok

- 예외처리 : 5를 누르고 1을 누른다 -> x
ㄴ 숫자의 합이 100이상이면 프로그램은 자동으로 종료 된다.

EX) 1과 5를 입력 -> 결과 값 : 9

과제3. 짝 맞추기

- 사이즈 : 5 x 4

- ☆ ★ ◇ ◆ ♤ ♠ ♡ ♥ ♧ ♣

- 짝이 맞춰진 번호는 계속 오픈된 상태로 있어야 한다.

- 2가지 버전으로 치트 만들기
ㄴ 1. 치트키를 누르면 패를 전부 오픈 시켜 플레이어에게 보여주고 5초뒤에 다시 원상 복귀 시킨다.
ㄴ 2. 치트키를 누르면 한쌍의 카드를 제외하고 전부 오픈된다.
		사용자가 마지막 한쌍을 맞추면서 게임이 종료되면 ok

	
과제4. 하이로우세븐
	- ♠  1 ~13까지의 카드
	- ◆ 1 ~13까지의 카드
	- ♣  1 ~13까지의 카드
	- ♥  1 ~13까지의 카드

종류별 13 장 -> 총 52장
- 52장의 카드를 최소 한번이상 랜덤으로 섞고 그 후 매턴마다 5장씩 뒤집는다.

- 앞쪽에 배치된 다섯장의 카드를 보고 6번째 카드의 숫자를 예측하는 게임

- 세븐보다 높으면 하이, 낮으면 로우, 아니면 세븐인지 중에 1개 배팅

- 세븐이면 13배 배당금 획득

- 돈 다 잃으면 끝


타임어택. 월남뽕

- 시간은 14분

*/