/*
도전 과제1. 문자와 문자열 과제

- 제한 시간 : 5분

<주의 사항>
- C++ 언어로 풀어야 하고 빈칸을 알맞게 채워 넣으시오.

- C런타임 라이브러리나 STL등 기타 라이브러리 함수를
사용하면 안됩니다.

- 특히 STL string을 사용할 시 바로 탈락 처리되니 유의바랍니다.

- 그리고 작성한 방법에 대해서 간단하게 왜 그렇게 했는지
주석을 추가하시오.

문제. 주어진 문자열을 단어 단위로 순서를 뒤집어 출력하세요
<예>
입력값 : "Hello World this is Pearl Abyss"
반환값 : "Pearl Abyss is this world Hello"

<조건>
입력 문자열은 앞뒤에 공백이 없다고 가정합니다.
모든 단어는 공백 한칸으로 구분된다고 가정합니다.

void ReverseWorlds(char ouput, int outputArraySize, const char* input)
{
	// 이곳을 채워 넣으시오.

}
*/

/*
과제2. 애니메이션 숫자 슬라이드

- 포인터를 활용해서 해온다.
- 룰은 동일
- 힌트 : char*, system("cls") 1 2 3 4 -> 1 2 4 3

한줄 조사. 클래스
- 노트에 적어온다.
- 이론에 기반해 짧고 명료하게 프로그래머스럽게 정리해 온다.
*/